---------------------------------------------------------------------
-- LAB 03
--
-- Exercise 1 (Solution)
---------------------------------------------------------------------

---------------------------------------------------------------------
-- Task 1
-- 
-- Найдите все таблицы на схеме Sales (в графическом редакторе)
---------------------------------------------------------------------

---------------------------------------------------------------------
-- Task 2
-- 
-- Напишите SELECT-запрос, возвращающий все строки и столбцы таблицы sales.customers (91 строка)
---------------------------------------------------------------------

SELECT *
FROM sales.customers;

SELECT custid, companyname, contactname, contacttitle, address, city, region, postalcode, country, phone, fax
FROM sales.customers;

---------------------------------------------------------------------
-- Task 3
-- 
-- В графическом редакторе просмотрите все столбцы таблицы sales.customers
-- Напишите SELECT-запрос, возвращающий столбцы contactname, address, postalcode, city и country.
---------------------------------------------------------------------
SELECT contactname, address, postalcode, city, country
FROM sales.customers;