---------------------------------------------------------------------
-- LAB 03
--
-- Exercise 2 (Solution)
---------------------------------------------------------------------

---------------------------------------------------------------------
-- Task 1
-- 
-- Напишите SELECT-запрос, возвращающий столбец country из таблицы production.suppliers (29 строк)
---------------------------------------------------------------------

SELECT country
FROM production.suppliers;


---------------------------------------------------------------------
-- Task 2
-- 
-- Скопируйте SELECT-запрос из Task 1 и выберите только уникальные значения столбца country (16 строк)
---------------------------------------------------------------------

SELECT DISTINCT country
FROM production.suppliers;

---------------------------------------------------------------------
-- В чем отличие результирующих наборов запросов, представленных ниже?
---------------------------------------------------------------------

SELECT city, region 
FROM sales.customers;

SELECT DISTINCT city, region 
FROM sales.customers;