---------------------------------------------------------------------
-- LAB 03
--
-- Exercise 3
---------------------------------------------------------------------

---------------------------------------------------------------------
-- Task 1
-- 
-- Напишите SELECT-запрос, выводящий столбцы contactname и contacttitle таблицы Sales.Customers
-- Задайте псевдоним таблицы - C. Испольуя псевдоним, обратитесь к столбцам
---------------------------------------------------------------------

SELECT C.contactname, C.contacttitle 
FROM "Sales"."Customers" AS C;

---------------------------------------------------------------------
-- Task 2
-- 
-- Напишите SELECT-запрос, возвращающий contactname, contacttitle и companyname из таблицы Sales.Customers. 
-- Задайте псевдонимы столбцам: Name, Title, и Company Name соответственно
---------------------------------------------------------------------

SELECT C.contactname AS "Name", C.contacttitle AS "Title", C.companyname AS "Company Name"
FROM "Sales"."Customers" AS C;

---------------------------------------------------------------------
-- Task 3
-- 
-- Напишите SELECT-запрос, возвращающий столбец productname таблицы Production.Products
-- P - псевдоним таблицы, Product Name - псевдоним столбца.
---------------------------------------------------------------------

SELECT P.productname AS "Product Name"
FROM "Production"."Products" AS P;

---------------------------------------------------------------------
-- Task 4
-- 
-- Имеется запрос к таблице Sales.Customers. Ожидалось, что запрос вернет два столбца.
-- Почему возвращается один столбец?
-- Исправить запрос, чтобы результирующий набор содержал city и country таблицы Sales.Customers 
---------------------------------------------------------------------

SELECT city country
FROM "Sales"."Customers";

--- исправленный
SELECT city, country
FROM "Sales"."Customers";