---------------------------------------------------------------------
-- LAB 09
--
-- Exercise 1
---------------------------------------------------------------------

---------------------------------------------------------------------
-- Task 1
--
-- Напишите SELECT-запрос, возвращающий группы заказчиков, которые что-то купили у сотрудника (empid) номер 5. Выведите custid из Sales.Orders table и contactname из Sales.Customers. 
-- Сгруппировать по столбцам custid и contactname
-- Результирующий набор сравните с Lab Exercise1 - Task1 Result.txt
---------------------------------------------------------------------



---------------------------------------------------------------------
-- Task 2
-- 
-- Скопируйте запрос Task 1 и добавьте в SELECT столбец city из Sales.Customers. 
-- Почему ошибка?
-- Исправьте запрос
-- Результирующий набор сравните с Lab Exercise1 - Task2 Result.txt
---------------------------------------------------------------------

-- error


-- исправленный



---------------------------------------------------------------------
-- Task 3
-- 
-- Напишите SELECT-запрос, возвращающий группы по custid и вычисляемому столбцу orderyear (год от даты orderdate из Sales.Orders)
-- Включите только заказы, оформленные сотрудником empid = 5
-- Результирующий набор сравните с Lab Exercise1 - Task3 Result.txt
---------------------------------------------------------------------



---------------------------------------------------------------------
-- Task 4
-- 
-- Напишите SELECT-запрос, возвращающий группы по categoryname из таблицы Production.Categories. 
-- Включите только те категории продуктов, продукты которых были оформлены в 2008 году.
-- Результирующий набор сравните с Lab Exercise1 - Task4 Result.txt
---------------------------------------------------------------------

