---------------------------------------------------------------------
-- LAB 09
--
-- Exercise 1
---------------------------------------------------------------------

---------------------------------------------------------------------
-- Task 1
--
-- Напишите SELECT-запрос, возвращающий заказчиков, которые что-то купили у сотрудника (empid) номер 5. 
-- Выведите custid из sales.orders и contactname из sales.customers. 
-- Сгруппировать по столбцам custid и contactname.
--
-- Результирующий набор сравните с Lab Exercise1 - Task1 Result.txt
---------------------------------------------------------------------



---------------------------------------------------------------------
-- Task 2
-- 
-- Скопируйте запрос Task 1 и добавьте в SELECT столбец city из sales.customers. 
-- Почему ошибка?
-- Исправьте запрос
--
-- Результирующий набор сравните с Lab Exercise1 - Task2 Result.txt
---------------------------------------------------------------------

-- error


-- исправленный



---------------------------------------------------------------------
-- Task 3
-- 
-- Напишите SELECT-запрос, возвращающий номера заказчиков и годы, когда они что-то купили (уникальные строки)
-- Включите только заказы, оформленные сотрудником empid = 5
--
-- Результирующий набор сравните с Lab Exercise1 - Task3 Result.txt
---------------------------------------------------------------------



---------------------------------------------------------------------
-- Task 4
-- 
-- Напишите SELECT-запрос, возвращающий категории (categoryid и categoryname) из таблицы production.categories.
-- Включите только те категории продуктов, которые были проданы 15 января 2023 г.
--
-- Результирующий набор сравните с Lab Exercise1 - Task4 Result.txt
---------------------------------------------------------------------

