---------------------------------------------------------------------
-- LAB 09
--
-- Exercise 4
---------------------------------------------------------------------

---------------------------------------------------------------------
-- Task 1
-- 
-- Напишите SELECT-запрос, возвращающий 10 заказчиков (custid) с максимальной суммой покупок.
-- Отфильтруйте результат, где общая сумма покупок по каждому заказчику больше $100,000
--
-- Результирующий набор сравните с Lab Exercise4 - Task1 Result.txt
---------------------------------------------------------------------



---------------------------------------------------------------------
-- Task 2
-- 
-- Напишите SELECT-запрос к таблицам sales.orders и sales.orderdetails, возвращающий номер заказа, общую сумму этого заказа и номер сотрудника (empid), оформившего заказ
-- Рассчитайте итоговые суммы продаж только за 2008 год. 
--
-- Результирующий набор сравните с Lab Exercise4 - Task2 Result.txt
---------------------------------------------------------------------



---------------------------------------------------------------------
-- Task 3
-- 
-- Измените запрос Task 2: найдите те строки, где суммы продаж больше $10,000.
-- Упорядочите по номеру сотрудника.
--
-- Результирующий набор сравните с Lab Exercise4 - Task3 Result.txt
---------------------------------------------------------------------




---------------------------------------------------------------------
-- Task 4
-- 
-- Измените запрос Task 3 так, чтобы вывести только строки по сотруднику номер 3.
--
-- Результирующий набор сравните с Lab Exercise4 - Task4 Result.txt
---------------------------------------------------------------------




---------------------------------------------------------------------
-- Task 5
-- 
-- Напишите SELECT-запрос, выводящий заказчиков, которые совершили более 25 заказов
-- Добавьте информацию о дате самого последнего заказа и общую сумму покупок
--
-- Результирующий набор сравните с Lab Exercise4 - Task5 Result.txt
---------------------------------------------------------------------




---------------------------------------------------------------------
-- Task 6 *
-- 
-- Напишите SELECT-запрос, выводящий заказчиков, общую сумму покупок и столбец ordersall, содержащий номера заказов через запятую (string_agg)
-- Общая сумма всех заказов должна быть меньше $2000.
-- Упорядочить по номеру заказчика.
--
-- Результирующий набор сравните с Lab Exercise4 - Task6 Result.txt
---------------------------------------------------------------------


---------------------------------------------------------------------
-- Task 7 *
-- 
-- Напишите SELECT-запрос, выводящий всех заказчиков (custid, companyname), которые покупали продукты категории Meat/Poultry, 
-- но ни разу не покупали продукты категории Seafood.
--
-- Результирующий набор сравните с Lab Exercise4 - Task7 Result.txt
---------------------------------------------------------------------
