---------------------------------------------------------------------
-- LAB 09
--
-- Exercise 4
---------------------------------------------------------------------

---------------------------------------------------------------------
-- Task 1
-- 
-- Напишите SELECT-запрос, возвращающий 10 заказчиков (custid), сумма покупок которых максимальна
-- Отфильтруйте результат, где общая сумма покупок по каждому заказчику больше  $100,000
-- Результирующий набор сравните с Lab Exercise4 - Task1 Result.txt
---------------------------------------------------------------------



---------------------------------------------------------------------
-- Task 2
-- 
-- Напишите SELECT-запрос к таблицам Sales.Orders и Sales.OrderDetails, возвращающий общую сумму продаж каждого сотрудника (empid) по каждому заказу (orderid)
-- Рассчитайте итоговые суммы продаж только за 2008 год. 
-- Результирующий набор сравните с Lab Exercise4 - Task2 Result.txt
---------------------------------------------------------------------



---------------------------------------------------------------------
-- Task 3
-- 
-- Измените запрос Task 2, найдите те строки, где суммы продаж больше $10,000.
-- Результирующий набор сравните с Lab Exercise4 - Task3 Result.txt
---------------------------------------------------------------------




---------------------------------------------------------------------
-- Task 4
-- 
-- Измените запрос Task 4, найдите те строки, где суммы продаж больше $10,000, но для сотрудника 3.
-- Результирующий набор сравните с Lab Exercise4 - Task4 Result.txt
---------------------------------------------------------------------




---------------------------------------------------------------------
-- Task 5
-- 
-- Напишите SELECT-запрос, выводящий заказчиков, которые совершили более 25 заказов
-- Добавьте информацию о дате самого последнего заказа и общую сумму покупок
-- Выведите также custid и два вычисляемых столбца lastorderdate, основанный на столбце дата заказа (orderdate), 
-- и totalsalesamount как количество (qty) умноженное на цену (unitprice) из таблицы Sales.OrderDetails.
--
-- Результирующий набор сравните с Lab Exercise4 - Task5 Result.txt
---------------------------------------------------------------------




---------------------------------------------------------------------
-- Task 6 *
-- 
-- Напишите SELECT-запрос, выводящий заказчиков, общую сумму покупок и столбец ordersAll, содержащий номера заказов через запятую (string_agg)
-- Общая сумма всех заказов должна быть меньше $2000
--
-- Результирующий набор сравните с Lab Exercise4 - Task6 Result.txt
---------------------------------------------------------------------

