---------------------------------------------------------------------
-- LAB 04
--
-- Exercise 1
---------------------------------------------------------------------

---------------------------------------------------------------------
-- Task 1
-- 
-- Напишите SELECT-запрос, возвращающий столбец productname таблицы Production.Products (p - псевдоним таблицы) и столбец categoryname таблицы Production.Categories  (c - псевдоним таблицы) 
-- Использовать inner join (77 строк)
---------------------------------------------------------------------


---------------------------------------------------------------------
-- Task 2
-- 
-- Выполните запрос. Почему ошибка?
---------------------------------------------------------------------

SELECT 
	custid, contactname, orderid
FROM "Sales"."Customers"
INNER JOIN "Sales"."Orders"
ON "Sales"."Customers".custid = "Sales"."Orders".custid;


---------------------------------------------------------------------
-- Task 3
-- 
-- Исправьте запрос Task 2. Используйте псевдонимы
-- Результирующий набор сравните с Lab Exercise1 - Task3 Result.txt
---------------------------------------------------------------------



---------------------------------------------------------------------
-- Task 4
-- 
-- Измените запрос Task 3, включив дополнительные столбцы из таблицы Sales.OrderDetails: productid, qty, unitprice.
-- Результирующий набор сравните с Lab Exercise1 - Task4 Result.txt
---------------------------------------------------------------------


---------------------------------------------------------------------
-- Task 5
--
-- Выведите всех поставщиков Production.Suppliers, а также их продукты, цены и название категории
-- Упорядочить по имени поставщика companyname
-- Результирующий набор сравните с Lab Exercise1 - Task5 Result.txt
---------------------------------------------------------------------



---------------------------------------------------------------------
-- Task 6
--
-- Выведите все заказы (и позиции в них), оформленные каждым менеджером
-- Упорядочить по empid
-- Результирующий набор сравните с Lab Exercise1 - Task6 Result.txt
---------------------------------------------------------------------

