---------------------------------------------------------------------
-- LAB 04
--
-- Exercise 2
---------------------------------------------------------------------

---------------------------------------------------------------------
-- Task 1
-- 
-- Напишите SELECT-запрос, выводящий информацию о сотруднике: empid, lastname, firstname, title и mgrid.
--
-- Результирующий набор сравните с Lab Exercise2 - Task1 Result.txt
---------------------------------------------------------------------



---------------------------------------------------------------------
-- Task 2
-- 
-- Скопируйте запрос Task 1 и добавьте информацию о руководителе (lastname, firstname) с использованием self-join. 
-- Псевдонимы на столбцы mgrlastname и mgrfirstname соответственно.
--
-- Результирующий набор сравните с Lab Exercise2 - Task2 Result.txt
-- Почему строк меньше, чем в результате Task 1?
---------------------------------------------------------------------



---------------------------------------------------------------------
-- Task 3
--
-- Напишите SELECT-запрос, выводящий custid и contactname таблицы sales.customers, а также orderid таблицы sales.orders. 
-- Запрос должен отобразить ВСЕ строки таблицы sales.customers.
--
-- Результирующий набор сравните с Lab Exercise2 - Task3 Result.txt
--
-- Есть ли пустые значения в orderid? почему?
---------------------------------------------------------------------
