---------------------------------------------------------------------
-- LAB 08
--
-- Exercise 1
---------------------------------------------------------------------

---------------------------------------------------------------------
-- Task 1
-- 
-- Напишите SELECT-запрос к таблице Production.Products с единственным вычисляемым столбцом productdesc. 
-- productdesc должен содержать строки следующего вида:
--  The unit price for the Product HHYDP is $18.00.
--
-- Результирующий набор сравните с Lab Exercise1 - Task1 Result.txt
---------------------------------------------------------------------




---------------------------------------------------------------------
-- Task 2
-- 
-- Отдел маркетинга предоставил дату начала 4/1/2007 (April 1, 2007) и дату окончания 11/30/2007 (November 30, 2007) периода. 
-- Напишите SELECT-запрос к таблице Sales.Orders и получите столбцы orderid, orderdate, shippeddate, shipregion.
-- Включите только те строки, которые подходят под условие отдела маркетинга (в их формате), а также имеют более 30 дней в промежутке между датой отправки и датой заказа
-- Если в столбце region есть значение NULL - при выводе заменить его на 'No region'.
--
-- Результирующий набор сравните с Lab Exercise1 - Task2 Result.txt
---------------------------------------------------------------------


---------------------------------------------------------------------
-- Task 3
-- 
-- Напишите SELECT-запрос, конвертирующий номера телефонов из таблицы Sales.Customers в числовые значения int / bigint.
-- Удалите все лишние символы в номерах перед конвертацией. 
--
-- Результирующий набор сравните с Lab Exercise1 - Task3 Result.txt
---------------------------------------------------------------------

