---------------------------------------------------------------------
-- LAB 08
--
-- Exercise 2
---------------------------------------------------------------------

---------------------------------------------------------------------
-- Task 1
-- 
-- Напишите SELECT-запрос к таблице Sales.Customers, выводящий custid и contactname.
-- Добавьте вычисляемый столбец segmentgroup с помощью array['Group One', 'Group Two', 'Group Three', 'Group Four']. Распределите заказчиков по custid в каждую группу (как остаток от деления)
-- Результирующий набор сравните с Lab Exercise2 - Task1 Result.txt
---------------------------------------------------------------------



---------------------------------------------------------------------
-- Task 2
-- 
-- Напишите SELECT-запрос, получающий contactname и fax из таблицы Sales.Customers. Если в fax стоит значение NULL - выводить  ‘No information’.
-- Результирующий набор сравните с Lab Exercise2 - Task2 Result.txt
---------------------------------------------------------------------




---------------------------------------------------------------------
-- Task 3
-- 
-- Напишите SELECT-запрос, получающий contactname, city, region из таблицы Sales.Customers. 
-- Верните только те строки, которые в столбце region содержат любое количество символов, кроме 2х.
--
-- Результирующий набор сравните с Lab Exercise2 - Task3 Result.txt
---------------------------------------------------------------------

