---------------------------------------------------------------------
-- LAB 03
--
-- Exercise 1
---------------------------------------------------------------------

---------------------------------------------------------------------
-- Task 1
-- 
-- Найдите все таблицы на схеме sales (в графическом редакторе)
---------------------------------------------------------------------

---------------------------------------------------------------------
-- Task 2
-- 
-- Напишите SELECT-запрос, возвращающий все строки и столбцы таблицы sales.customers (91 строка)
---------------------------------------------------------------------



---------------------------------------------------------------------
-- Task 3
-- 
-- В графическом редакторе просмотрите все столбцы таблицы sales.customers
-- Напишите SELECT-запрос, возвращающий столбцы contactname, address, postalcode, city и country.
---------------------------------------------------------------------
