---------------------------------------------------------------------
-- LAB 03
--
-- Exercise 1
---------------------------------------------------------------------

---------------------------------------------------------------------
-- Task 1
-- 
-- Найдите все таблицы на схеме Sales (в графическом редакторе)
---------------------------------------------------------------------

---------------------------------------------------------------------
-- Task 2
-- 
-- Напишите SELECT-запрос, возвращающий все строки и столбцы таблицы Sales.Customers (91 строка)
---------------------------------------------------------------------



---------------------------------------------------------------------
-- Task 3
-- 
-- В графическом редакторе просмотрите все столбцы таблицы Sales.Customers
-- Напишите SELECT-запрос, возвращающий столбцы contactname, address, postalcode, city и country.
---------------------------------------------------------------------
