---------------------------------------------------------------------
-- LAB 03
--
-- Exercise 2
---------------------------------------------------------------------

---------------------------------------------------------------------
-- Task 1
-- 
-- Напишите SELECT-запрос, возвращающий столбец country из таблицы Production.Suppliers (29 строк)
---------------------------------------------------------------------




---------------------------------------------------------------------
-- Task 2
-- 
-- Скопируйте SELECT-запрос из Task 1 и выберите только уникальные значения столбца country (16 строк)
---------------------------------------------------------------------



---------------------------------------------------------------------
-- В чем отличие результирующих наборов запросов, представленных ниже
---------------------------------------------------------------------

SELECT city, region 
FROM "Sales"."Customers";

SELECT DISTINCT city, region 
FROM "Sales"."Customers";