---------------------------------------------------------------------
-- LAB 03
--
-- Exercise 3
---------------------------------------------------------------------

---------------------------------------------------------------------
-- Task 1
-- 
-- Напишите SELECT-запрос, выводящий столбцы contactname и contacttitle таблицы Sales.Customers
-- Задайте псевдоним таблицы - C. Испольуя псевдоним, обратитесь к столбцам
---------------------------------------------------------------------



---------------------------------------------------------------------
-- Task 2
-- 
-- Напишите SELECT-запрос, возвращающий contactname, contacttitle и companyname из таблицы Sales.Customers. 
-- Задайте псевдонимы столбцам: Name, Title, и Company Name соответственно
---------------------------------------------------------------------



---------------------------------------------------------------------
-- Task 3
-- 
-- Напишите SELECT-запрос, возвращающий столбец productname таблицы Production.Products
-- P - псевдоним таблицы, Product Name - псевдоним столбца.
---------------------------------------------------------------------



---------------------------------------------------------------------
-- Task 4
-- 
-- Имеется запрос к таблице Sales.Customers. Ожидалось, что запрос вернет два столбца.
-- Почему возвращается один столбец?
-- Исправить запрос, чтобы результирующий набор содержал city и country таблицы Sales.Customers 
---------------------------------------------------------------------

SELECT city country
FROM "Sales"."Customers";

--- исправленный
