---------------------------------------------------------------------
-- LAB 03
--
-- Exercise 3
---------------------------------------------------------------------

---------------------------------------------------------------------
-- Task 1
-- 
-- Напишите SELECT-запрос, выводящий столбцы contactname и contacttitle таблицы sales.customers
-- Задайте псевдоним таблицы - C. Испольуя псевдоним, обратитесь к столбцам
---------------------------------------------------------------------



---------------------------------------------------------------------
-- Task 2
-- 
-- Напишите SELECT-запрос, возвращающий contactname, contacttitle и companyname из таблицы sales.customers. 
-- Задайте псевдонимы столбцам: Name, Title, и Company Name соответственно
---------------------------------------------------------------------



---------------------------------------------------------------------
-- Task 3
-- 
-- Напишите SELECT-запрос, возвращающий столбец productname таблицы production.products
-- P - псевдоним таблицы, Product Name - псевдоним столбца.
---------------------------------------------------------------------



---------------------------------------------------------------------
-- Task 4
-- 
-- Имеется запрос к таблице sales.customers. Ожидалось, что запрос вернет два столбца.
-- Почему возвращается один столбец?
-- Исправить запрос, чтобы результирующий набор содержал city и country таблицы sales.customers
---------------------------------------------------------------------

SELECT city country
FROM sales.customers;

--- исправленный
