---------------------------------------------------------------------
-- LAB 03
--
-- Exercise 4
---------------------------------------------------------------------

---------------------------------------------------------------------
-- Task 1
--
-- Напишите SELECT-запрос, возвращающий столбцы categoryid и productname таблицы Production.Products
---------------------------------------------------------------------



---------------------------------------------------------------------
-- Task 2
--
-- Измените запрос Task 1, добавив вычисляемый столбец categoryname с использованием CASE
-- categoryname должен выводить соответствующее имя категории, основываясь на номере categoryid
-- Результирующий набор сравните с Lab Exercise4 - Task2 Result.txt. 
---------------------------------------------------------------------



---------------------------------------------------------------------
-- Task 3
--
-- Измените запрос Task 2, добавив еще один вычисляемый столбец iscampaign с использованием CASE
-- iscampaign имеет значение "Campaign Products" для категорий Beverages, Produceи Seafood; значение "Non-Campaign Products" для остальных категорий
-- Результирующий набор сравните с Lab Exercise4 - Task3 Result.txt. 
---------------------------------------------------------------------




---------------------------------------------------------------------
-- Task 4
-- 
-- Напишите SELECT-запрос, возвращающий custid и contactname из Sales.Customers.
-- Добавьте вычисляемый столбец, выводящий target group для заказчиков из Mexico и имеющих значение Owner в contact title. Для всех остальных выводите 'Other'. 
--
-- Результирующий набор сравните с Lab Exercise4 - Task4 Result.txt. 
---------------------------------------------------------------------
