---------------------------------------------------------------------
-- LAB 03
--
-- Exercise 4
---------------------------------------------------------------------

---------------------------------------------------------------------
-- Task 1
--
-- Напишите SELECT-запрос, возвращающий столбцы categoryid и productname таблицы production.products.
---------------------------------------------------------------------



---------------------------------------------------------------------
-- Task 2
--
-- Измените запрос Task 1, добавив вычисляемый столбец categoryname с использованием CASE
-- categoryname должен выводить соответствующее имя категории, основываясь на номере categoryid.
--
-- Результирующий набор сравните с Lab Exercise4 - Task2 Result.txt. 
---------------------------------------------------------------------



---------------------------------------------------------------------
-- Task 3
--
-- Измените запрос Task 2, добавив еще один вычисляемый столбец iscampaign с использованием CASE
--     iscampaign имеет значение 'Campaign Products' для категорий Beverages, Produce и Seafood; 
--     значение 'Non-Campaign Products' для остальных категорий.
--
-- Результирующий набор сравните с Lab Exercise4 - Task3 Result.txt. 
---------------------------------------------------------------------




---------------------------------------------------------------------
-- Task 4
-- 
-- Напишите SELECT-запрос, возвращающий custid и contactname из sales.customers.
-- Добавьте вычисляемый столбец с именем segmentgroup, выводящий target group для заказчиков из Mexico и имеющих значение Owner в contacttitle. 
-- Для всех остальных выводите 'Other'. 
--
-- Результирующий набор сравните с Lab Exercise4 - Task4 Result.txt. 
---------------------------------------------------------------------
