---------------------------------------------------------------------
-- LAB 05
--
-- Exercise 1
---------------------------------------------------------------------

---------------------------------------------------------------------
-- Task 1
-- 
-- Напишите SELECT-запрос, возвращающий столбцы custid, companyname, contactname, address, city, country и phone из таблицы sales.customers. 
-- Отфильтруйте результат, получив только заказчиков из Brazil.
--
-- Результирующий набор сравните с Lab Exercise1 - Task1 Result.txt
---------------------------------------------------------------------




---------------------------------------------------------------------
-- Task 2
-- 
-- Напишите SELECT-запрос, возвращающий столбцы custid, companyname, contactname, address, city, country и phone из таблицы sales.customers. 
-- Отфильтруйте результат, получив только заказчиков из Brazil, UK и USA.
--
-- Результирующий набор сравните с Lab Exercise1 - Task2 Result.txt
---------------------------------------------------------------------


---------------------------------------------------------------------
-- Task 3
-- 
-- Напишите SELECT-запрос, возвращающий столбцы custid, companyname, contactname, address, city, country и phone из таблицы sales.customers. 
-- Выведите только заказчиков, contactname которых начинается на букву A.
--
-- Результирующий набор сравните с Lab Exercise1 - Task3 Result.txt
---------------------------------------------------------------------




---------------------------------------------------------------------
-- Task 4a
-- 
-- Есть запрос, выводящий custid и companyname из таблицы sales.customers и orderid из таблицы sales.orders.
-- Выполните запрос. Что вернул запрос?
--
---- Обратите внимание, что в ON содержится city = 'Paris'
---------------------------------------------------------------------

SELECT c.custid, c.companyname, o.orderid
FROM sales.customers AS c
LEFT OUTER JOIN sales.orders AS o 
ON c.custid = o.custid AND c.city = 'Paris'
ORDER BY c.custid;

---------------------------------------------------------------------
-- Task 4b
-- 
-- Скопируйте запрос Task 4a и поместите условие city = 'Paris' в инструкцию WHERE. 
--
-- Результирующий набор сравните с Lab Exercise1 - Task4b Result.txt
-- Что произошло?
---------------------------------------------------------------------



---------------------------------------------------------------------
-- Task 5
-- 
-- Напишите SELECT-запрос, выводящий заказчиков из таблицы sales.customers, которые еще не совершали заказы (не имеют заказов в таблице sales.orders). 
-- Вывести столбцы custid и companyname из sales.customers. 
--
-- Результирующий набор сравните с Lab Exercise1 - Task5 Result.txt
---------------------------------------------------------------------


---------------------------------------------------------------------
-- Task 6
-- 
-- Напишите SELECT-запрос, выводящий заказы, которые еще не были отправлены (в столбце shippeddate стоит значение NULL). 
-- Вывести столбцы orderid, orderdate, shipcountry (из sales.orders),
-- а также фамилию и должность сотрудника, оформившего заказ (из таблицы hr.employees)
-- Упорядочить по фамилии сотрудника
--
-- Результирующий набор сравните с Lab Exercise1 - Task6 Result.txt
---------------------------------------------------------------------

