---------------------------------------------------------------------
-- LAB 05
--
-- Exercise 4
---------------------------------------------------------------------

---------------------------------------------------------------------
-- Task 1
-- 
-- Напишите SELECT-запрос, возвращающий столбцы custid, orderid и orderdate из таблицы Sales.Orders. 
-- Упорядочить строки по столбцам orderdate и orderid.
-- Получить первые 20 строк.
-- Результирующий набор сравните с Lab Exercise4 - Task1 Result.txt
---------------------------------------------------------------------



---------------------------------------------------------------------
-- Task 2
-- 
-- Скопируйте запрос Task 1, сформировав вторую страницу: пропустить 20 строк и получить следующие 20 строк.
-- Результирующий набор сравните с Lab Exercise4 - Task2 Result.txt
---------------------------------------------------------------------




---------------------------------------------------------------------
-- Task 3 *
-- Сделайте запрос Task 2 универсальным, используя переменные
-- Создайте параметры pagenum (номер страницы) и pagesize (размер страницы); напишите запрос с OFFSET-FETCH
---------------------------------------------------------------------

