---------------------------------------------------------------------
-- LAB 12
--
-- Exercise 3
---------------------------------------------------------------------

---------------------------------------------------------------------
-- Task 1
-- 
-- Напишите SELECT-запрос, выводящий custid из таблицы sales.orders. 
-- Выведите только тех заказчиков, которые купили более 20 различных продуктов (productid из sales.orderdetails).
--
-- Результирующий набор сравните с Lab Exercise3 - Task1 Result.txt
---------------------------------------------------------------------




---------------------------------------------------------------------
-- Task 2
-- 
-- Напишите SELECT-запрос, выводящий custid из таблицы sales.orders.
-- Выведите только заказчиков из USA и исключите заказчиков, полученных в Task 1.
--
-- Результирующий набор сравните с Lab Exercise3 - Task2 Result.txt
---------------------------------------------------------------------




---------------------------------------------------------------------
-- Task 3
-- 
-- Напишите SELECT-запрос, выводящий custid из таблицы sales.orders.
-- Выведите только тех заказчиков, кто купил на суммму более 10,000 у.е. (qty * unitprice из sales.orderdetails).
--
-- Результирующий набор сравните с Lab Exercise3 - Task3 Result.txt
---------------------------------------------------------------------




---------------------------------------------------------------------
-- Task 4
-- 
-- Скопируйте весь запрос Task 2, убрав условие, что заказчики должны быть из USA. 
-- Добавьте оператор INTERSECT, а после него - запрос Task 3.
-- Сколько строк вернулось и почему?
--
-- Результирующий набор сравните с Lab Exercise3 - Task4 Result.txt
---------------------------------------------------------------------




---------------------------------------------------------------------
-- Task 5
-- 
-- Скопируйте запрос Task 4 и добавьте скобки к первой группе запросов (с начала и до INTERSECT).
-- Сколько строк вернулось и почему?
--
-- Результирующий набор сравните с Lab Exercise3 - Task5 Result.txt
---------------------------------------------------------------------


