---------------------------------------------------------------------
-- LAB 06
--
-- Exercise 1
---------------------------------------------------------------------

---------------------------------------------------------------------
-- Task 1
-- 
-- 
-- Напишите SELECT-запрос, который выводит следующие столбцы:
--  Текущие дата и время. Псевдоним currentdt.
--  Только текущая дата. Псевдоним currentdate.
--  Только текущее время. Псевдоним currenttime.
--  Только текущий год. Псевдоним currentyear.
--  Только текущий месяц. Псевдоним currentmonth.
--  Только текущий день. Псевдоним currentday.
--  Текущая неделя в году. Псевдоним currentweeknumber.
--  Название текущего месяца. Псевдоним currentmonthname.
-- 
-- Результирующий набор сравните с Lab Exercise1 - Task1 Result.txt.

---------------------------------------------------------------------




---------------------------------------------------------------------
-- Task 2
--  
-- Запишите дату '2020-12-11' (date) в виде строки 'December 11, 2020. Week 50'. Псевдоним somedate.
---------------------------------------------------------------------



---------------------------------------------------------------------
-- Task 3
-- 
-- Напишите SELECT-запрос, который выводит следующие столбцы:
--  Три месяца от текущей даты-времени. Псевдоним threemonths.
--  Количество дней между значением столбца threemonths и текущей датой. Псевдоним diffdays.
--  Разница между April 4, 1992 и September 16, 2011 (Функция AGE). Псевдоним diffAge.
--  Первый день текущего месяца (датой). Функция date_trunc. Псевдоним firstday.
--
-- Результирующий набор сравните с Lab Exercise1 - Task3 Result.txt. 
---------------------------------------------------------------------

