---------------------------------------------------------------------
-- LAB 06
--
-- Exercise 2
---------------------------------------------------------------------

---------------------------------------------------------------------
-- Task 1
-- 
-- Напишите SELECT-запрос, выводящий уникальных покупателей (столбец custid) из таблицы Sales.Orders. Примените фильтр к заказам: оформлены в феврале 2008.
--
-- Результирующий набор сравните с Lab Exercise2 - Task1 Result.txt.
---------------------------------------------------------------------



---------------------------------------------------------------------
-- Task 2
-- 
-- Напишите SELECT-запрос со следующими столбцами:
--  Текущая дата и время
--  Первая дата текущего месяца
--  Последняя дата текущего месяца
--
-- Результирующий набор сравните с Lab Exercise2 - Task2 Result.txt. 
---------------------------------------------------------------------



---------------------------------------------------------------------
-- Task 3
-- 
-- Напишите SELECT-запрос к таблице Sales.Orders и получите orderid, custid, orderdate. Выведите заказы, которые были оформлены в последние 5 дней каждого месяца.
--
-- Результирующий набор сравните с Lab Exercise2 - Task3 Result.txt.
---------------------------------------------------------------------



---------------------------------------------------------------------
-- Task 4
-- 
-- Напишите SELECT-запрос к таблицам Sales.Orders Sales.Orders и Sales.OrderDetails, получите уникальные значения столбца productid. 
-- Выведите только те заказы, которые были оформлены в первые 10 недель 2007 года.
--
-- Результирующий набор сравните с Lab Exercise2 - Task4 Result.txt.
---------------------------------------------------------------------

