---------------------------------------------------------------------
-- LAB 06
--
-- Exercise 4
---------------------------------------------------------------------

---------------------------------------------------------------------
-- Task 1
-- 
-- Напишите SELECT-запрос к таблице Sales.Customers и получите contactname. Добавьте вычисляемый столбец с псевдонимом lastname, состоящий из всех символов до запятой contactname (фамилия).
--
-- Результирующий набор сравните с Lab Exercise4 - Task1 Result.txt. 
---------------------------------------------------------------------



---------------------------------------------------------------------
-- Task 2
-- 
-- Напишите SELECT-запрос к таблице Sales.Customers и получите contactname, заменив запятую в contactname пустой строкой. 
-- Добавьте вычисляемый столбец с псевдонимом firstname, состоящий из всех символов после запятой (имя).
--
-- Результирующий набор сравните с Lab Exercise4 - Task2 Result.txt. 
---------------------------------------------------------------------



---------------------------------------------------------------------
-- Task 3
-- 
-- Напишите SELECT-запрос к таблице Sales.Customers, получите custid. Добавьте вычисляемый столбец, определяющий custid как фиксированный шестизначный код покупателя с префиксом C и последующими 0. 
-- Код покупателя - шестизначный (C00000).
-- Например, значение custid, равное 1, должно отображаться как C00001.
--
-- Результирующий набор сравните с Lab Exercise4 - Task3 Result.txt. 
---------------------------------------------------------------------



---------------------------------------------------------------------
-- Task 4
--
-- Напишите SELECT-запрос к таблице Sales.Customers, получите contactname. Добавьте вычисляемый столбец, выводящий количество букв 'а' (регистр не учитывать) в contactname.
-- Упорядочить результат от наибольших повторений к наименьшим.
--
-- Результирующий набор сравните с Lab Exercise4 - Task4 Result.txt. 
---------------------------------------------------------------------

